### withColumn()
1. Transform operation
2. Used to change value, create a new column, convert datatype of existing column

In [1]:
# creating spark session and df

from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("learning").getOrCreate()

24/11/08 17:08:17 WARN Utils: Your hostname, padmanabhan-VirtualBox resolves to a loopback address: 127.0.1.1; using 10.0.2.15 instead (on interface enp0s3)
24/11/08 17:08:17 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/11/08 17:08:19 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [8]:
# Change colume datatype

data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]

columns = ["firstname","middlename","lastname","dob","gender","salary"]
df = spark.createDataFrame(data,schema=columns)

In [9]:
df.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [10]:
from pyspark.sql.functions import col
df2 = df.withColumn("salary",col("salary").cast("String")) #if new column is needed give different name

In [11]:
df2.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)

In [14]:
# modify the column value 
# syntax : withColumn (column_to_change or new column , existing column)

df3 = df2.withColumn("modified_column",col("salary")*10)
# in above case even salary is in string type it is automatically converted to int

In [18]:
df2.printSchema()
df3.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- modified_column: double (nullable = true)

In [27]:
df2.withColumn("temp",col("firstname")*3).show()  # create null values in the new column

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|     NULL|          |   Smith|1991-04-01|     M|  3000|
|     NULL|      Rose|        |2000-05-19|     M|  4000|
|     NULL|          |Williams|1978-09-05|     M|  4000|
|     NULL|      Anne|   Jones|1967-12-01|     F|  4000|
|     NULL|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [31]:
# add new column
from pyspark.sql.functions import lit
df.withColumn("temp",lit("TEST")).withColumn("temp2",lit("TEST2")).show()

+---------+----------+--------+----------+------+------+----+-----+
|firstname|middlename|lastname|       dob|gender|salary|temp|temp2|
+---------+----------+--------+----------+------+------+----+-----+
|    James|          |   Smith|1991-04-01|     M|  3000|TEST|TEST2|
|  Michael|      Rose|        |2000-05-19|     M|  4000|TEST|TEST2|
|   Robert|          |Williams|1978-09-05|     M|  4000|TEST|TEST2|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|TEST|TEST2|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|TEST|TEST2|
+---------+----------+--------+----------+------+------+----+-----+

In [32]:
# renaming column name
df.withColumnRenamed("gender","sex").show(truncate=False)

+---------+----------+--------+----------+---+------+
|firstname|middlename|lastname|dob       |sex|salary|
+---------+----------+--------+----------+---+------+
|James    |          |Smith   |1991-04-01|M  |3000  |
|Michael  |Rose      |        |2000-05-19|M  |4000  |
|Robert   |          |Williams|1978-09-05|M  |4000  |
|Maria    |Anne      |Jones   |1967-12-01|F  |4000  |
|Jen      |Mary      |Brown   |1980-02-17|F  |-1    |
+---------+----------+--------+----------+---+------+

In [33]:
# drop column
df.drop("gender").show()

+---------+----------+--------+----------+------+
|firstname|middlename|lastname|       dob|salary|
+---------+----------+--------+----------+------+
|    James|          |   Smith|1991-04-01|  3000|
|  Michael|      Rose|        |2000-05-19|  4000|
|   Robert|          |Williams|1978-09-05|  4000|
|    Maria|      Anne|   Jones|1967-12-01|  4000|
|      Jen|      Mary|   Brown|1980-02-17|    -1|
+---------+----------+--------+----------+------+